#include <stdio.h>
#include <unistd.h>

#include <iostream>
using namespace std;

#include "../src/my_openSSL.h"
#include "../src/fileConvLib.h"
#include <openssl/md5.h>

#include <chrono>

#define FAIL -1

// int main()
// {
//     int server  = OpenConnection();     // Создание сокета клиента
//     int choice = 1;

//     char buf[1024] = {0};
//     int bytes;
//     // Сообщение для отправки сообщения через сокет
//     const char acClientRequest1[1024] = "Hi, it`s client";
//     const char acClientRequest2[1024] = "Connection is OK";


//     // Опционально
//     SSL_CTX *ctx = InitCTX();           // Инициализация методов шифрования;
//     SSL *ssl = SSL_new(ctx);            // Создание SSL соединения
//     // Инициализация библиотеки SSL
//     SSL_library_init();
//     SSL_set_fd(ssl, server);            // Прикрепление сокета к SSL
//     if ( SSL_connect(ssl) == FAIL )     // Соединение по SSL
//     {
//         ERR_print_errors_fp(stderr);
//         printf("SSL_connect(ssl) == FAIL\n");
//         return -1;
//     }
//     // Печать шифронабора
//     printf("\n\nConnected with %s encryption\n", SSL_get_cipher(ssl));
//     // Печать сертификата сервера
//     ShowCerts(ssl);   
//     // Отправка зашифрованного сообщения                     
//     SSL_write(ssl,acClientRequest1, strlen(acClientRequest1));   
//     // Получение сообщения
//     bytes = SSL_read(ssl, buf, sizeof(buf));
//     buf[bytes] = 0;
//     printf("Received: \"%s\"\n", buf);
//     //_______________________________

//     // Опционально
//     SSL_free(ssl);              // Закрытие соединения SSL
//     SSL_CTX_free(ctx);          // Закрытие методов шифрования
//     //_______________________________
    
//     close(server);              // Закрытие сокета
//     return 0;
// }

// struct Params{
//     int socket;                 // сокет
//     int choice;

//     SSL *ssl     = NULL;        // Для OpenSSL
//     SSL_CTX *ctx = NULL;        // Для OpenSSL

//     string key;                 // Для самописного шифратора
// };



int main()
{
    Params info;

    // Выбор метода шифрования
    info.choice = 1;

    // Начало отсчёта
    auto begin = std::chrono::steady_clock::now();
    
    // Создание сокета клиента и установление защищенного соединения
    int socket = OpenConnection(&info);  

    // Переменные для теста
    char ClientRequest1[1024] = "Hello From Client!!123456"; 
    char ClientRequest2[1024] = "Hello от Клиента!!!!!!!"; 

    string asd = "Hello от Клиента!!!!!!!"; 

    char sendFile1[128] = "../Test111.txt";
    char sendFile2[128] = "../Test.txt";  
    char sendFile3[128] = "../Test_jpg.jpg";      
     
    //string Msg = "1234567890 Текст на русском больше занимает места, поэтому я пишу на нём и ни на что не отвлекаюсь, это чистый полёт фантазии, я не понимаю что пишу, оно льётся из меня, мой разум пуст, хочется поскорей сдать уже, поэтмоу я отключил всё кроме рук, думаю на нобелевку потянет эта белиберда, сколько можно уже, длиннее войны и мир, остановиться не могу, хочу только писать и писать и писать... Всё ещё мало, полюбому нужен рецепт блинов: 1. Подготовьте все необходимые ингредиенты. Простые блины на молоке - фото шаг 2 2. В глубокую миску разбейте яйца, добавьте щепотку соли и сахар по вкусу. Слегка взбейте ручным венчиком, чтобы яйца стали более-менее однородными. Простые блины на молоке - фото шаг 3 3. Затем добавьте небольшое количество молока и снова размешайте. Простые блины на молоке - фото шаг 4 4. Всыпьте муку и полностью вмешайте ее в молочно-яичную массу. Простые блины на молоке - фото шаг 5 5. Теперь добавьте оставшееся молоко (можно влить не все сразу, чтобы посмотреть на консистенцию и только потом по необходимости добавить остальное). Приготовив тесто моим способом, вы добьетесь полностью однородной консистенции и в тесте не будет ни одного комочка. Тесто должно получиться по консистенции похожим на густой кефир, но более вязким. Кстати, чтобы не смазывать каждый раз сковороду маслом, масло можно добавить сразу в тесто (но если у вас хорошая сковорода с антипригарным покрытием, то масло вам и так не понадобится). Простые блины на молоке - фото шаг 6 6. Дайте тесту постоять 10-15 минут. Затем разогрейте сковороду и смажьте ее небольшим количеством растительного масла (только для первого блина, далее этого делать не нужно). Налейте на сковороду полчерпака теста и распределите по дну. Выпекайте блинчик около минуты на одной стороне. Затем переверните и блин широкой деревянной лопаткой и подержите на горячей сковороде еще полминуты. Простые блины на молоке - фото шаг 7 7. Сложите готовые блины стопкой на блюдо или заверните в них начинку. Простые блины на молоке - фото шаг 8 8. Приятного чаепития!";
    //string Msg = "Приятного чае";
    //string Msg = "1. В миску влить молоко и вод";
    //string Msg = "1. В миску влить молоко и воду, всыпать сахар, соль, хоро\n";
    //string Msg = "1. В миску влить молоко и воду, всыпать сахар, соль, хорошо размешать.\n2. Добавить яйца, тщательно взбить венчико";
    //string Msg = "1. В миску влить молоко и воду, всыпать сахар, соль, хорошо размешать.\n2. Добавить яйца, тщательно взбить венчиком.\n3. Постепенно всыпать просеянную муку, постоянно взб\n";
    //string Msg = "1. В миску влить молоко и воду, всыпать сахар, соль, хорошо размешать. \n 2. Добавить яйца, тщательно взбить венчиком.\n3. Постепенно всыпать просеянную муку, постоянно взбивая, мука должна полностью вмешаться, без комочков.123\n";
    //string Msg = "1. В миску влить молоко и воду, всыпать сахар, соль, хорошо размешать. \n 2. Добавить яйца, тщательно взбить венчиком.\n3. Постепенно всыпать просеянную муку, постоянно взбивая, мука должна полностью вмешаться, без комочков.123\n4. В конце влить растительное масло, перемешать. Тесто п";
    //string Msg = "1. В миску влить молоко и воду, всыпать сахар, соль, хорошо размешать. \n 2. Добавить яйца, тщательно взбить венчиком.\n3. Постепенно всыпать просеянную муку, постоянно взбивая, мука должна полностью вмешаться, без комочков.123\n4. В конце влить растительное масло, перемешать. Тесто получится как очень жидкая сметана.\n5. Сковороду, желате\n";
    //string Msg = "1. В миску влить молоко и воду, всыпать сахар, соль, хорошо размешать. \n 2. Добавить яйца, тщательно взбить венчиком.\n3. Постепенно всыпать просеянную муку, постоянно взбивая, мука должна полностью вмешаться, без комочков.123\n4. В конце влить растительное масло, перемешать. Тесто получится как очень жидкая сметана.\n5. Сковороду, желательно с толстым дном, хорошо разогреть. Половником набир";
    //string Msg = "1. В миску влить молоко и воду, всыпать сахар, соль, хорошо размешать. \n 2. Добавить яйца, тщательно взбить венчиком.\n3. Постепенно всыпать просеянную муку, постоянно взбивая, мука должна полностью вмешаться, без комочков.123\n4. В конце влить растительное масло, перемешать. Тесто получится как очень жидкая сметана.\n5. Сковороду, желательно с толстым дном, хорошо разогреть. Половником набираем тесто (примерно 1/3 половника), выливаем на сковород\n";
    //string Msg = "1. В миску влить молоко и воду, всыпать сахар, соль, хорошо размешать. \n 2. Добавить яйца, тщательно взбить венчиком.\n3. Постепенно всыпать просеянную муку, постоянно взбивая, мука должна полностью вмешаться, без комочков.123\n4. В конце влить растительное масло, перемешать. Тесто получится как очень жидкая сметана.\n5. Сковороду, желательно с толстым дном, хорошо разогреть. Половником набираем тесто (примерно 1/3 половника), выливаем на сковородку и, вращая сковороду, круговыми движениями распредел\n";
    //string Msg = "1. В миску влить молоко и воду, всыпать сахар, соль, хорошо размешать. \n 2. Добавить яйца, тщательно взбить венчиком.\n3. Постепенно всыпать просеянную муку, постоянно взбивая, мука должна полностью вмешаться, без комочков.123\n4. В конце влить растительное масло, перемешать. Тесто получится как очень жидкая сметана.\n5. Сковороду, желательно с толстым дном, хорошо разогреть. Половником набираем тесто (примерно 1/3 половника), выливаем на сковородку и, вращая сковороду, круговыми движениями распределяем равномерно тесто. Жарить около 15 секунд, до золотис\n";
    //string Msg = "1. В миску влить молоко и воду, всыпать сахар, соль, хорошо размешать. \n 2. Добавить яйца, тщательно взбить венчиком.\n3. Постепенно всыпать просеянную муку, постоянно взбивая, мука должна полностью вмешаться, без комочков.123\n4. В конце влить растительное масло, перемешать. Тесто получится как очень жидкая сметана.\n5. Сковороду, желательно с толстым дном, хорошо разогреть. Половником набираем тесто (примерно 1/3 половника), выливаем на сковородку и, вращая сковороду, круговыми движениями распределяем равномерно тесто. Жарить около 15 секунд, до золотистых краёв.\n6. Поддеть край блинчика ножом или силиконовой лопаткой и перевернуть (я переворачиваю руками, это совсем не страшно и не горячо). Обжарить со второй стороны и, так же поддев краешек, снять со сковороды.\n7. Горячий блин смазать сливочным маслом. Жарим блины из всего теста и складываем стопочкой.8. Подать можно с любым сиропом, сгущенным молоком, растопленным шоколадом и с чем позволит ваша фантазия.\nПриятного аппетита!!\n6. Поддеть край блинчика ножом или силиконовой лопаткой и перевернуть (я переворачиваю руками, это совсем не страшно и \n";
    //string Msg = "1. В миску влить молоко и воду, всыпать сахар, соль, хорошо размешать. \n 2. Добавить яйца, тщательно взбить венчиком.\n3. Постепенно всыпать просеянную муку, постоянно взбивая, мука должна полностью вмешаться, без комочков.123\n4. В конце влить растительное масло, перемешать. Тесто получится как очень жидкая сметана.\n5. Сковороду, желательно с толстым дном, хорошо разогреть. Половником набираем тесто (примерно 1/3 половника), выливаем на сковородку и, вращая сковороду, круговыми движениями распределяем равномерно тесто. Жарить около 15 секунд, до золотистых краёв.\n6. Поддеть край блинчика ножом или силиконовой лопаткой и перевернуть (я переворачиваю руками, это совсем не страшно и не горячо). Обжарить со второй стороны и, так же поддев краешек, снять со сковороды.\n7. Горячий блин смазать сливочным маслом. Жарим блины из всего теста и складываем стопочкой.8. Подать можно с любым сиропом, сгущенным молоком, растопленным шоколадом и с чем позволит ваша фантазия.\nПриятного аппетита!!\n6. Поддеть край блинчика ножом или силиконовой лопаткой и перевернуть (я переворачиваю руками, это совсем не страшно и \n4. В конце влить растительное масло, перемешать. Тесто получится как очень жидкая сметана.\n5. Сковороду, желательно с толстым дном, хорошо разогреть. Половником набираем тесто (примерно 1/3 половника), выливаем на сковородку и, вращая сковороду, круговыми движениями распределяем равномерно тесто. Жарить около 15 секунд, до золотистых краёв. 4. В конце влить растительное масло, перемешать. Тесто получится как очень жидкая сметана.5. Сковороду, желательно с толстым дном, хорошо разогреть. Половником набираем тесто (примерно 1/3 половника), выливаем на ";
    string Msg = "1. В миску влить молоко и воду, всыпать сахар, соль, хорошо размешать. \n 2. Добавить яйца, тщательно взбить венчиком.\n3. Постепенно всыпать просеянную муку, постоянно взбивая, мука должна полностью вмешаться, без комочков.123\n4. В конце влить растительное масло, перемешать. Тесто получится как очень жидкая сметана.\n5. Сковороду, желательно с толстым дном, хорошо разогреть. Половником набираем тесто (примерно 1/3 половника), выливаем на сковородку и, вращая сковороду, круговыми движениями распределяем равномерно тесто. Жарить около 15 секунд, до золотистых краёв.\n6. Поддеть край блинчика ножом или силиконовой лопаткой и перевернуть (я переворачиваю руками, это совсем не страшно и не горячо). Обжарить со второй стороны и, так же поддев краешек, снять со сковороды.\n7. Горячий блин смазать сливочным маслом. Жарим блины из всего теста и складываем стопочкой.8. Подать можно с любым сиропом, сгущенным молоком, растопленным шоколадом и с чем позволит ваша фантазия.\nПриятного аппетита!!\n6. Поддеть край блинчика ножом или силиконовой лопаткой и перевернуть (я переворачиваю руками, это совсем не страшно и \n4. В конце влить растительное масло, перемешать. Тесто получится как очень жидкая сметана.\n5. Сковороду, желательно с толстым дном, хорошо разогреть. Половником набираем тесто (примерно 1/3 половника), выливаем на сковородку и, вращая сковороду, круговыми движениями распределяем равномерно тесто. Жарить около 15 секунд, до золотистых краёв. 4. В конце влить растительное масло, перемешать. Тесто получится как очень жидкая сметана.5. Сковороду, желательно с толстым дном, хорошо разогреть. Половником набираем тесто (примерно 1/3 половника), выливаем на 1. В миску влить молоко и воду, всыпать сахар, соль, хорошо размешать. \n 2. Добавить яйца, тщательно взбить венчиком.\n3. Постепенно всыпать просеянную муку, постоянно взбивая, мука должна полностью вмешаться, без комочков.123\n4. В конце влить растительное масло, перемешать. Тесто получится как очень жидкая сметана.\n5. Сковороду, желательно с толстым дном, хорошо разогреть. Половником набираем тесто (примерно 1/3 половника), выливаем на сковородку и, вращая сковороду, круговыми движениями распределяем равномерно тесто. Жарить около 15 секунд, до золотистых краёв.\n6. Поддеть край блинчика ножом или силиконовой лопаткой и перевернуть (я переворачиваю руками, это совсем не страшно и не горячо). Обжарить со второй стороны и, так же поддев краешек, снять со сковороды.\n7. Горячий блин смазать сливочным маслом. Жарим блины из всего теста и складываем стопочкой.8. Подать можно с любым сиропом, сгущенным молоком, растопленным шоколадом и с чем позволит ваша фантазия.\nПриятного аппетита!!\n6. Поддеть край блинчика ножом или силиконовой лопаткой и перевернуть (я переворачиваю руками, это совсем не страшно и \n";

    sendLooongMsg(Msg, info, socket);
    recvFile(info, socket);

    // SendMessage(info, ClientRequest1, strlen(ClientRequest1), info.s_server);      // Отправка сообщения
    // string Answer = RecvMessage(info, info.s_server, 0);
    // SendMessage(info, ClientRequest2, strlen(ClientRequest2), info.s_server);      // Отправка сообщения

    // Передача указанного файла
    // sendFile(sendFile1, info, info.s_server);
    // recvFile(info, info.s_server);

    // Закрытие сокета/сокетов
    ClosingSocketsClient(&info);

    cout << "__________________________________"<< endl;

    // Конец отсчёта
    auto end = std::chrono::steady_clock::now();
    auto elapsed_ms = std::chrono::duration_cast<std::chrono::microseconds>(end - begin);
  	std::cout << "Время: " << elapsed_ms.count() << "mcs" << std::endl;

    //close(info.s_server);
    //close(socket);

    // Результаты
    //cout << "Answer: " << Answer << endl;



    string str = Msg;
    unsigned char result[MD5_DIGEST_LENGTH];
    MD5((unsigned char*)str.c_str(), str.size(), result);

    cout << "Хэш длинного сообщения, отправленного клиентом:" << endl;
    for(long long c: result)
    {
        //sout<<std::setw(2)<<(long long)c;
        //cout << (long long)c;
        printf("%.2X", (long long)c);
    }
    cout << endl;

    return 0;
}

    // // Передача указанного файла
    // sendFile("../Test_jpg.jpg", info);
    // RecvMessage(info, info.s_server, 0);
    
    // // recvFile(info, info.s_server);                                              // Получение файла
    // // sendFile(sendFile3, info, info.s_server);                                   // Отправка файла
    //SendMessage(info, ClientRequest1, strlen(ClientRequest1), info.s_server);      // Отправка сообщения
    //string Answer = RecvMessage(info, info.s_server, 0);
    //SendMessage(info, ClientRequest2, strlen(ClientRequest2), info.s_server);      // Отправка сообщения




    // // Сообщение для отправки сообщения через сокет
    //char ClientRequest[1024] = "���� JFIF  H H  �� C";
    
    // // Получение/отправка/получение сообщения
    // RecvMessage(info, info.s_server);
    //SendMessage(info, ClientRequest, 64, info.s_server);
    // RecvMessage(info, info.s_server);

    //int size = fileToTXT("../Test111.txt");
    //int size = fileToTXT("../Test.txt");
    // int size = fileToTXT("../Test_jpg.jpg");
    // int part = 1000;
    // int count = size/part;
    // if(size%part > 0) count++;

    // cout << size << endl;

    // ifstream f("./result.txt");
    // //ofstream fin("./result123.txt");
    
    // for(int i = 0;i < count; i++)
    // {
    //     char SendFromClient[1024];
    //     int sizeMsg = part;
    //     if(i == (count-1)) sizeMsg = size%part;

    //     f.read(SendFromClient, sizeMsg); // Read one less that sizeof(b) to ensure null
    //     SendFromClient[sizeMsg] = 0;

    //     // Отправка
    //     SendMessage(info, SendFromClient, sizeMsg, info.s_server);
    // }

    // cout << "size: " << size << endl;


    // f.close();
    //fin.close();
    //TXTtoFile("./result123.txt");


    // // функция
    // // int sendLooongMsg(string Msg, int socket){
    // int size = Msg.length() + to_string(Msg.length()).length() + 1;

    // cout << "to_string(Msg.length()).length(): " << to_string(Msg.length()).length() << endl;
    // //int sizeTemp = to_string(size);
    // int part = 1000;                        // Число одного перевода
    // int count = size/part;                  // Количество переводов
    // if(size%part > 0) count++;              // Поправка количества переводов для некратных файлов
    // int sizeFile;

    // string MsgToSend = to_string(Msg.length()) + " " + Msg;
    // cout << "size Msg: " << Msg.length() << endl;
    // cout << "count: " << Msg.length() << endl;
    // //cout << "Temp: " << Temp << endl;
    
    // for(int i = 0;i < count; i++)
    // {
    //   char charSendMsg[1024];
    //   int sizeMsg = part;
    //   if(i == (count-1)) sizeMsg = size%part; // Если перевод последний

    //   (MsgToSend.substr(i*1000, i*1000+sizeMsg)).copy(charSendMsg, sizeMsg);
    //   charSendMsg[sizeMsg] = 0;            // Установка терминального нуля

    //   // Отправка
    //   SendMessage(info, charSendMsg, sizeMsg, socket);

    //   string RecvClient(charSendMsg, sizeMsg);
    //   cout << "RecvClient: " << RecvClient << endl;
    //   if(i == 0)
    //   {
    //     sizeFile = stoi(RecvClient.substr(0, RecvClient.find(" ")));    // Размер в int
    //   }
    // }

    // cout << "sizeFile: " << sizeFile << endl;

    // //}